//
//  DataManager.swift
//  PlantControl
//
//  Created by Варвара Фомина on 14.11.2021.
//

class DataManager {
    
    let shared = DataManager()
    
    let name = [
        "ЭПИПРЕМНУМ АУРЕУМ",
        "БЕГОНИЯ РЕКС РЕД ХАРТ",
        "АГЛАОНЕМА МАРИЯ",
        "ЗАМИОКУЛЬКАС"
    ]
    
    let latinName = [
        "Epipremnum aureum",
        "Begonia rex red heart",
        "Aglaonema Commutatum Maria",
        "Zamioculcas"
    ]
    
    let plantOfDay = [
        "ФИКУС БЕНГАЛЬСКИЙ (лат. Ficus benghalensis)",
        "ФИКУС БЕНДЖАМИНА ГРИН КИНКИ (лат.Ficus benjamina 'Kinky')",
        "ЦИКАС (лат. Cycas)"
    ]
    
    let plantOfDayInformation = [
        "Фикус бенгальский обладает декоративным внешним видом. Помимо этого такая культура эффективно очищает воздух от вредных веществ, к примеру, от аммиака, формальдегида, бензола и фенола. А еще это дерево выделяет в воздух активные вещества, которые способствуют улучшению самочувствия людей. Помимо этого фикус обладает целебными свойствами, поэтому его нередко используют для изготовления лекарственных средств в форме настоек и мазей, которые помогают при различных заболеваниях. Также это растение используют в косметической промышленности.",
        "Фикус Кинки — карликовый сорт с пестрыми светло-зелеными листьями, который является разновидностью популярного фикуса Бенджамина. Иногда его называют фикус Грин Кинки. Отличительной особенностью фикуса является возможность формирования кроны и придание ей любой формы, поэтому это вечнозеленое декоративное деревце прекрасно впишется в любой интерьер и станет украшением квартиры.",
        "Цикас родом из Юго-восточной Азии и Австралии. Относится к семейству саговниковых. Это одно из самых древнейших растений, в переводе означает пальма. Его листва плотная, зеленого цвета, ствол крупный. Прекрасно переносит колебания температур, не прихотлив ни к освещению, ни к влажности. Считается выносливым растением, не требующим специального ухода."
    ]
    
    
    private init() {}
}
